<?php
// データベース接続

// テーブルへデータを挿入(INSERT)
// テーブルからデータを取得(SELECT)
// データベース切断
// 「名前」の入力値をチェック
// 「コメント」の入力値をチェック
// HTMLとして表示する文字をHTMLエンティティに変換する








?>
// 利用者が名前とコメントを入力し、発言できる。
// 利用者の過去発言内容をデータベースで管理する。
// 全ての利用者の過去発言を一覧で見ることができ、「名前、コメント、発言日時」の最低限3つを1行ずつ表示する。
// 利用者の名前は最大20文字以内とし、それ以上の場合はエラーメッセージを表示し、発言できないようにする。
// 利用者のコメントは最大100文字以内とし、それ以上の場合はエラーメッセージを表示し、発言できないようにする。
// 利用者の名前、コメントのどちらか又は両方が未入力だった場合、エラーメッセージを表示し、発言できないようにする。
<!DOCTYPE html>
<html lang="ja">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>ひとこと掲示板</title>
</head>

<body>

</body>

</html>